# DaNDashM Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DaNDashM Property
SymbolTypeId Class See Also
---
Symbol daN-m, indicating unit Dekanewton meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DaNDashM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DaNDashM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DaNDashM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace